{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "emb_size": 312,
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "\u0410\u043a\u0441\u0435\u0441\u0441\u0443\u0430\u0440\u044b \u0438 \u0417\u0430\u043f\u0447\u0430\u0441\u0442\u0438",
    "1": "\u0421\u043d\u0430\u0440\u044f\u0436\u0435\u043d\u0438\u0435 \u0438 \u0437\u0430\u0449\u0438\u0442\u0430",
    "2": "\u0421\u0442\u0440\u0430\u0439\u043a\u0431\u043e\u043b\u044c\u043d\u043e\u0435 \u043e\u0440\u0443\u0436\u0438\u0435"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "is_decoder": false,
  "label2id": {
    "\u0410\u043a\u0441\u0435\u0441\u0441\u0443\u0430\u0440\u044b \u0438 \u0417\u0430\u043f\u0447\u0430\u0441\u0442\u0438": 0,
    "\u0421\u043d\u0430\u0440\u044f\u0436\u0435\u043d\u0438\u0435 \u0438 \u0437\u0430\u0449\u0438\u0442\u0430": 1,
    "\u0421\u0442\u0440\u0430\u0439\u043a\u0431\u043e\u043b\u044c\u043d\u043e\u0435 \u043e\u0440\u0443\u0436\u0438\u0435": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.9.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 83828
}
